Build output
stdout<<ghadelimiter_f8d5774a-238b-4900-b396-5edd384145cd
Terraform v1.4.6
on linux_amd64
+ provider registry.terraform.io/hashicorp/google v4.73.2
+ provider registry.terraform.io/hashicorp/google-beta v4.73.2

Your version of Terraform is out of date! The latest version
is 1.5.3. You can update by downloading from https://www.terraform.io/downloads.html

ghadelimiter_f8d5774a-238b-4900-b396-5edd384145cd
stderr<<ghadelimiter_de886b63-0447-4d45-9a57-5ed4a40db629

ghadelimiter_de886b63-0447-4d45-9a57-5ed4a40db629
exitcode<<ghadelimiter_416331ad-e6e4-46bb-88a1-f48429e32611
0
ghadelimiter_416331ad-e6e4-46bb-88a1-f48429e32611
[command]/home/runner/work/_temp/23918cac-f8da-4936-b718-4582cddefe99/terraform-bin plan -input=false
Acquiring state lock. This may take a few moments...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m

Terraform will perform the following actions:

[1m  # google_compute_network.network[0m will be created
[0m  [32m+[0m[0m resource "google_compute_network" "network" {
      [32m+[0m[0m auto_create_subnetworks                   = false
      [32m+[0m[0m delete_default_routes_on_create           = false
      [32m+[0m[0m gateway_ipv4                              = (known after apply)
      [32m+[0m[0m id                                        = (known after apply)
      [32m+[0m[0m internal_ipv6_range                       = (known after apply)
      [32m+[0m[0m mtu                                       = 0
      [32m+[0m[0m name                                      = "vpc-test-deploy-392912-prod"
      [32m+[0m[0m network_firewall_policy_enforcement_order = "AFTER_CLASSIC_FIREWALL"
      [32m+[0m[0m project                                   = "test-deploy-392912"
      [32m+[0m[0m routing_mode                              = "GLOBAL"
      [32m+[0m[0m self_link                                 = (known after apply)
    }

[1mPlan:[0m 1 to add, 0 to change, 0 to destroy.
[0m
Changes to Outputs:
  [32m+[0m[0m network           = {
      [32m+[0m[0m auto_create_subnetworks                   = false
      [32m+[0m[0m delete_default_routes_on_create           = false
      [32m+[0m[0m description                               = ""
      [32m+[0m[0m enable_ula_internal_ipv6                  = [90mnull[0m[0m
      [32m+[0m[0m gateway_ipv4                              = (known after apply)
      [32m+[0m[0m id                                        = (known after apply)
      [32m+[0m[0m internal_ipv6_range                       = (known after apply)
      [32m+[0m[0m mtu                                       = 0
      [32m+[0m[0m name                                      = "vpc-test-deploy-392912-prod"
      [32m+[0m[0m network_firewall_policy_enforcement_order = "AFTER_CLASSIC_FIREWALL"
      [32m+[0m[0m project                                   = "test-deploy-392912"
      [32m+[0m[0m routing_mode                              = "GLOBAL"
      [32m+[0m[0m self_link                                 = (known after apply)
      [32m+[0m[0m timeouts                                  = [90mnull[0m[0m
    }
  [32m+[0m[0m network_id        = (known after apply)
  [32m+[0m[0m network_name      = "vpc-test-deploy-392912-prod"
  [32m+[0m[0m network_self_link = (known after apply)
  [32m+[0m[0m project_id        = "test-deploy-392912"
[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
::debug::Terraform exited with code 0.
::debug::stdout: Acquiring state lock. This may take a few moments...%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  [32m+[0m create[0m%0A%0ATerraform will perform the following actions:%0A%0A[1m  # google_compute_network.network[0m will be created%0A[0m  [32m+[0m[0m resource "google_compute_network" "network" {%0A      [32m+[0m[0m auto_create_subnetworks                   = false%0A      [32m+[0m[0m delete_default_routes_on_create           = false%0A      [32m+[0m[0m gateway_ipv4                              = (known after apply)%0A      [32m+[0m[0m id                                        = (known after apply)%0A      [32m+[0m[0m internal_ipv6_range                       = (known after apply)%0A      [32m+[0m[0m mtu                                       = 0%0A      [32m+[0m[0m name                                      = "vpc-test-deploy-392912-prod"%0A      [32m+[0m[0m network_firewall_policy_enforcement_order = "AFTER_CLASSIC_FIREWALL"%0A      [32m+[0m[0m project                                   = "test-deploy-392912"%0A      [32m+[0m[0m routing_mode                              = "GLOBAL"%0A      [32m+[0m[0m self_link                                 = (known after apply)%0A    }%0A%0A[1mPlan:[0m 1 to add, 0 to change, 0 to destroy.%0A[0m%0AChanges to Outputs:%0A  [32m+[0m[0m network           = {%0A      [32m+[0m[0m auto_create_subnetworks                   = false%0A      [32m+[0m[0m delete_default_routes_on_create           = false%0A      [32m+[0m[0m description                               = ""%0A      [32m+[0m[0m enable_ula_internal_ipv6                  = [90mnull[0m[0m%0A      [32m+[0m[0m gateway_ipv4                              = (known after apply)%0A      [32m+[0m[0m id                                        = (known after apply)%0A      [32m+[0m[0m internal_ipv6_range                       = (known after apply)%0A      [32m+[0m[0m mtu                                       = 0%0A      [32m+[0m[0m name                                      = "vpc-test-deploy-392912-prod"%0A      [32m+[0m[0m network_firewall_policy_enforcement_order = "AFTER_CLASSIC_FIREWALL"%0A      [32m+[0m[0m project                                   = "test-deploy-392912"%0A      [32m+[0m[0m routing_mode                              = "GLOBAL"%0A      [32m+[0m[0m self_link                                 = (known after apply)%0A      [32m+[0m[0m timeouts                                  = [90mnull[0m[0m%0A    }%0A  [32m+[0m[0m network_id        = (known after apply)%0A  [32m+[0m[0m network_name      = "vpc-test-deploy-392912-prod"%0A  [32m+[0m[0m network_self_link = (known after apply)%0A  [32m+[0m[0m project_id        = "test-deploy-392912"%0A[90m%0A─────────────────────────────────────────────────────────────────────────────[0m%0A%0ANote: You didn't use the -out option to save this plan, so Terraform can't%0Aguarantee to take exactly these actions if you run "terraform apply" now.%0A
::debug::stderr: 
::debug::exitcode: 0
stdout<<ghadelimiter_d05cbf87-65b4-4962-b4dc-02176bdbe7f8
Acquiring state lock. This may take a few moments...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m

Terraform will perform the following actions:

[1m  # google_compute_network.network[0m will be created
[0m  [32m+[0m[0m resource "google_compute_network" "network" {
      [32m+[0m[0m auto_create_subnetworks                   = false
      [32m+[0m[0m delete_default_routes_on_create           = false
      [32m+[0m[0m gateway_ipv4                              = (known after apply)
      [32m+[0m[0m id                                        = (known after apply)
      [32m+[0m[0m internal_ipv6_range                       = (known after apply)
      [32m+[0m[0m mtu                                       = 0
      [32m+[0m[0m name                                      = "vpc-test-deploy-392912-prod"
      [32m+[0m[0m network_firewall_policy_enforcement_order = "AFTER_CLASSIC_FIREWALL"
      [32m+[0m[0m project                                   = "test-deploy-392912"
      [32m+[0m[0m routing_mode                              = "GLOBAL"
      [32m+[0m[0m self_link                                 = (known after apply)
    }

[1mPlan:[0m 1 to add, 0 to change, 0 to destroy.
[0m
Changes to Outputs:
  [32m+[0m[0m network           = {
      [32m+[0m[0m auto_create_subnetworks                   = false
      [32m+[0m[0m delete_default_routes_on_create           = false
      [32m+[0m[0m description                               = ""
      [32m+[0m[0m enable_ula_internal_ipv6                  = [90mnull[0m[0m
      [32m+[0m[0m gateway_ipv4                              = (known after apply)
      [32m+[0m[0m id                                        = (known after apply)
      [32m+[0m[0m internal_ipv6_range                       = (known after apply)
      [32m+[0m[0m mtu                                       = 0
      [32m+[0m[0m name                                      = "vpc-test-deploy-392912-prod"
      [32m+[0m[0m network_firewall_policy_enforcement_order = "AFTER_CLASSIC_FIREWALL"
      [32m+[0m[0m project                                   = "test-deploy-392912"
      [32m+[0m[0m routing_mode                              = "GLOBAL"
      [32m+[0m[0m self_link                                 = (known after apply)
      [32m+[0m[0m timeouts                                  = [90mnull[0m[0m
    }
  [32m+[0m[0m network_id        = (known after apply)
  [32m+[0m[0m network_name      = "vpc-test-deploy-392912-prod"
  [32m+[0m[0m network_self_link = (known after apply)
  [32m+[0m[0m project_id        = "test-deploy-392912"
[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

ghadelimiter_d05cbf87-65b4-4962-b4dc-02176bdbe7f8
stderr<<ghadelimiter_73c63753-89d7-4614-be29-d02786d85554

ghadelimiter_73c63753-89d7-4614-be29-d02786d85554
exitcode<<ghadelimiter_7ae170ef-9800-4777-8c94-4dfa517c2186
0
ghadelimiter_7ae170ef-9800-4777-8c94-4dfa517c2186